IDENTIFICATION DIVISION.
PROGRAM-ID. FREEFORM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-AGE PIC 9(3) VALUE 20.
   88 ADULT VALUE 18 THRU 199.
   88 CHILD VALUE 0 THRU 17.
PROCEDURE DIVISION.
    IF ADULT THEN DISPLAY "ADULT" END-IF.
    MOVE 10 TO WS-AGE.
    IF CHILD THEN DISPLAY "CHILD" END-IF.
    STOP RUN.
